
public class Main {

	public static void main(String[] args) {
		// 블랙잭 문제
		
		/*
		 * << 문제 요약 >>
		 * N장의 카드를 모두 숫자가 보이도록 바닥에 놓음 -> 3개의 숫자가 생김
		 * 임의의 숫자 M이 주어짐
		 * N장의 카드 중 3장을 고름
		 * -> 그 합이 M을 넘지 않으면서 가장 가까운 수여야 함
		 * 
		 * 그 합을 구하기
		 * 
		 * << 입력 & 출력 >>
		 * 첫 줄에 3<=N<=100과 10<=M<=30만
		 * 둘째 줄에 N장의 카드에 쓰여있는 수가 주어짐 (각각 <= 10만)
		 * 합이 M을 넘지 않는 카드 3장을 찾을 수 있는 경우의 수만 주어짐
		 * 
		 * << 알고리즘 생각 >>
<<<<<<< HEAD
		 * 우선은 가장 가까운 값을 찾는 방법은 1. M보다 작고 2. M과의 차(절대값)이 가장 적은 합을 찾기
		 * 합은 어떻게 구하는가가 핵심
		 * 
=======
		 * 아마 풀이는 가능한 모든 조합을 구해서 그 합이 M을 넘지 않는 경우 중 가장 큰 수 구하기.
		 * 이걸 어떻게 코딩으로 구현한담?
		 * 
		 * 둘째 줄에 들어오는, 카드에 쓰여 있는 수들을 일차원 배열에 저장
>>>>>>> refs/remotes/origin/master
		 * 
		 * 
		 * 
		 */

	}

}
