
public class Main {

	public static void main(String[] args) {
		// 부등호 문제
		/*
		 * << 문제 요약 >>
		 * 부등호 순서열 A안에 k개의 부등호가 나열됨(<와 >만)
		 * 서로 다른 0~9의 숫자 중에서 부등호 앞뒤에 숫자를 넣어 순서열을 만족 시,
		 * 각 숫자를 이어붙여 만든 k+1 자리의 숫자가 생김
		 * 이 k+1 자리의 정수값 중 최대, 최소를 각각 출력해야됨
		 * 
		 * << 생각 >>
		 * 부등호는 두 가지 <, >
		 * a < b
		 * a > b
		 * 이렇게 두 개씩만 계속 비교하고 불가능해질 때 break;
		 * 그 외에 가능해지는 경우의 수가 나오면 저장.
		 * 
		 * << 구현 >>
		 * 1. a를 n번째 자리에 넣는다()
		 * 2. 부등호[n-1]자리에 있는 부등호를 확인하고 n+1번째 자리에 들어갈 숫자를 탐색한다.
		 * 2-1. "<"이면 0 ~ a-1 (a-1>=0)를 만족하지 못하면 break;
		 * 2-2. ">"이면 
		 * 
		 */
		
		
	}

}
